tutorials/channel_fluctuating_U/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    /* default         leastSquares; */
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(phi,k)      Gauss limitedLinear 0.1;
    div(phi,B)      Gauss limitedLinear 0.1;
    div(B)          Gauss linear;
    div(phi,nuTilda) Gauss limitedLinear 0.1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
    /* default         Gauss linear uncorrected; */
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    /* default         uncorrected; */
    default         orthogonal;
}


// ************************************************************************* //
